OpenFOAM-5.x-master/tutorials/mesh/foamyHexMesh/mixerVessel/system/collapseDict
collapseDict.collapseFaces